# National University Ranking

![](images/2023-07-13-00-48-01.png)

## Introduction

## Reasearch Idea: 
### Developing a searchable database to help high school students identify colleges that match their criteria in terms of tuition, graduation rate, location, and rank.

ROUGH OUTLINE
1. extract the state short code from location
2. extract the year founded from description
3. clean up the fees, in-state and enrollment columns
4. clean up the columns names

* 51 states

5. seperate each state schools
6. each state will be a table of it's own in the database for database optimization
7. create a state table
8. can rank school inside each state based on enrollment

-- EDA

9. Top school based on rank, tuition fees, instate fees, and enrollment
10. Top 2 schools within 56 states
11. oldest schools based on year founded
12. oldest school within 51 states

-- App interface

13. A brief overview with visuals from top school based on rank (overall)
14. selection box to select state. Once selected, brief overview with a visual of the top school in that state.
* Overview will include details based on the available data like average tuition and top ranked school.
15. Another section where we take in input from the user to recommend a movie within a choosen state.
16. If no state is choosen, we recommend based on the user location, and closest state.
* For closest state, we can do some resear to know which state is closer to each other (Feature engineering) 

## Objectives
Outline breakdown

### Data Cleaning: 
* Objective: Clean the data and feature engineer new columns
* Tools: Python

### EDA
* Objective: Create visuals from the cleaned data
* Tools: Power BI, Python

### Database Engineers
* Objective: Create the database and the schema. Views if possible
* Tools: SQL

### Project App
* Objective: Create the user interface
* Tools: Python, SQL, USer

### Technical Writers
* Objective: Document every process
* Microsoft/Google Suites (Slide, Docs, Excel, etc)

## Have a video meeting to discuss milestone achievement

### Import Libraries

In [1]:
import pandas as pd
import plotly.express as px

In [2]:
# Loading the dataset
nur = pd.read_csv("dataset/National Universities Rankings.csv", index_col=0)
nur.shape

(231, 7)

In [3]:
nur.head()

,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment
index,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...","$45,320",NaN,"5,402"
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...","$47,074",NaN,"6,699"
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...","$52,491",NaN,"5,844"
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...","$49,480",NaN,"5,532"
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...","$55,056",NaN,"6,102"

In [4]:
df_nur = nur.copy()

In [5]:
# Promise
# Remove the dollar sign ($) and comma
df_nur['Tuition and fees'] = df_nur['Tuition and fees'].str.replace('$', '').str.replace(',', '')

# convert the column datatype to integer
df_nur['Tuition and fees'] = df_nur['Tuition and fees'].fillna('0').astype(int)

/tmp/ipykernel_5376/3096994647.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_nur['Tuition and fees'] = df_nur['Tuition and fees'].str.replace('$', '').str.replace(',', '')

In [6]:
# precious
# data cleaning by replacing ',' with '' and converting column to integer
df_nur['Undergrad Enrollment'] = df_nur['Undergrad Enrollment'].str.replace(',','').astype('int')

In [7]:
#Olufemilite
#Changing column headers to lower case and changing spaces to underscore
df_nur.rename(columns={"Name":"name","Location":"location","Rank":"rank","Description":"description",
                       "Tuition and fees":"tuition_and_fees","In-state":"in_state","Undergrad enrollment":"undergrad_enrollment"}, inplace=True)
df_nur.head()

,name,location,rank,description,tuition_and_fees,in_state,Undergrad Enrollment
index,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,NaN,5402
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,NaN,6699
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,NaN,5844
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...",49480,NaN,5532
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...",55056,NaN,6102

In [8]:
df_nur.head()

,name,location,rank,description,tuition_and_fees,in_state,Undergrad Enrollment
index,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,NaN,5402
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,NaN,6699
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,NaN,5844
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...",49480,NaN,5532
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...",55056,NaN,6102

In [9]:
nur['Location'].apply(lambda x: x.split(',')[1]).unique()

array([' NJ', ' MA', ' IL', ' CT', ' NY', ' CA', ' NC', ' PA', ' MD',
       ' NH', ' RI', ' TX', ' IN', ' TN', ' MO', ' GA', ' DC', ' VA',
       ' MI', ' OH', ' LA', ' FL', ' WI', ' WA', ' SC', ' UT', ' MN',
       ' DE', ' CO', ' IA', ' OK', ' VT', ' AL', ' OR', ' NE', ' KS',
       ' AZ', ' KY', ' AR', ' MS', ' HI', ' ID', ' WY', ' NM', ' ME',
       ' WV', ' ND', ' NV', ' SD', ' AK', ' MT'], dtype=object)

In [10]:
len(nur['Location'].apply(lambda x: x.split(',')[1]).unique())

51

In [11]:
df_nur.dtypes

name                    object
location                object
rank                     int64
description             object
tuition_and_fees         int64
in_state                object
Undergrad Enrollment     int64
dtype: object

In [12]:
df_nur.isna().sum()

name                     0
location                 0
rank                     0
description              0
tuition_and_fees         0
in_state                98
Undergrad Enrollment     0
dtype: int64

### Cleaning the undergraduate enrollment column

In [13]:
# create a copy of dataframe
df_nur = nur.copy()

In [14]:
# access dataframe
df_nur.head(1)

,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment
index,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...","$45,320",NaN,"5,402"

In [15]:
# access datatype
df_nur.dtypes

Name                    object
Location                object
Rank                     int64
Description             object
Tuition and fees        object
In-state                object
Undergrad Enrollment    object
dtype: object

In [16]:
# data cleaning by replacing ',' with '' and converting column to integer
df_nur['Undergrad Enrollment'] = df_nur['Undergrad Enrollment'].str.replace(',','').astype('int')

In [17]:
# check
df_nur.sample(5)

,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment
index,,,,,,,
222,New Mexico State University,"Las Cruces, NM",220,There are five New Mexico State University loc...,"$21,234","$6,729",12526
48,University of Wisconsin--Madison,"Madison, WI",44,The University of Wisconsin--Madison lies alon...,"$32,738","$10,488",31662
192,University of Hartford,"West Hartford, CT",188,"The University of Hartford, also known as UHar...","$37,790",NaN,5246
124,DePaul University,"Chicago, IL",124,DePaul University has five campuses in and aro...,"$37,626",NaN,15961
89,University of San Diego,"San Diego, CA",86,The University of San Diego is a Roman Catholi...,"$46,140",NaN,5647

In [18]:
# check
df_nur.dtypes

Name                    object
Location                object
Rank                     int64
Description             object
Tuition and fees        object
In-state                object
Undergrad Enrollment     int64
dtype: object

In [19]:
df_nur['Location']

index
0            Princeton, NJ
1            Cambridge, MA
2              Chicago, IL
3            New Haven, CT
4             New York, NY
              ...
226    North Dartmouth, MA
227          St. Louis, MO
228         Greensboro, NC
229        Hattiesburg, MS
230              Logan, UT
Name: Location, Length: 231, dtype: object

In [20]:
# Function to extract the state name from the given format (e.g., 'Boston, MA')
def get_state_name(location):
    return location.split(',')[0].strip()

def get_state_code(location):
    return location.split(',')[1].strip()

In [21]:
# Map state names to regions and create the 'region' column
df_nur['State Name'] = df_nur['Location'].apply(get_state_name)

df_nur['State Code'] = df_nur['Location'].apply(get_state_code)

In [22]:
df_nur['State Name']

index
0            Princeton
1            Cambridge
2              Chicago
3            New Haven
4             New York
            ...
226    North Dartmouth
227          St. Louis
228         Greensboro
229        Hattiesburg
230              Logan
Name: State Name, Length: 231, dtype: object

In [23]:
df_nur['State Code']

index
0      NJ
1      MA
2      IL
3      CT
4      NY
       ..
226    MA
227    MO
228    NC
229    MS
230    UT
Name: State Code, Length: 231, dtype: object

In [24]:
pd.set_option('display.max_columns', None)

In [25]:
state_name =df_nur['State Name'].values.tolist()

In [26]:
print(state_name)

['Princeton', 'Cambridge', 'Chicago', 'New Haven', 'New York', 'Stanford', 'Cambridge', 'Durham', 'Philadelphia', 'Baltimore', 'Hanover', 'Pasadena', 'Evanston', 'Providence', 'Ithaca', 'Houston', 'Notre Dame', 'Nashville', 'St. Louis', 'Atlanta', 'Washington', 'Berkeley', 'Los Angeles', 'Pittsburgh', 'Los Angeles', 'Charlottesville', 'Medford', 'Ann Arbor', 'Winston-Salem', 'Chapel Hill', 'Chestnut Hill', 'Williamsburg', 'Rochester', 'Waltham', 'Atlanta', 'New York', 'Cleveland', 'Santa Barbara', 'Boston', 'Boston', 'Troy', 'New Orleans', 'Irvine', 'Bethlehem', 'Davis', 'La Jolla', 'Champaign', 'Coral Gables', 'Madison', 'Malibu', 'Gainesville', 'Villanova', 'University Park', 'Columbus', 'Seattle', 'Washington', 'Dallas', 'Athens', 'Austin', 'New York', 'West Lafayette', 'Syracuse', 'Storrs', 'College Park', 'Worcester', 'Clemson', 'New York', 'Provo', 'Pittsburgh', 'Piscataway', 'Waco', 'Hoboken', 'Minneapolis', 'Washington', 'Worcester', 'College Station', 'Amherst', 'Blacksburg', 'Oxford', 'Santa Cruz', 'Newark', 'Golden', 'East Lansing', 'Fort Worth', 'Iowa City', 'Binghamton', 'Bloomington', 'Milwaukee', 'Denver', 'San Diego', 'Tulsa', 'Tallahassee', 'Raleigh', 'Boulder', 'Burlington', 'Philadelphia', 'St. Louis', 'Stony Brook', 'Auburn', 'Chicago', 'Syracuse', 'Buffalo', 'Chicago', 'Tuscaloosa', 'Eugene', 'Knoxville', 'Rochester', 'Durham', 'San Francisco', 'Columbia', 'Ames', 'Dayton', 'Columbia', 'Lincoln', 'Norman', 'Stockton', 'Salt Lake City', 'Houghton', 'South Orange', 'Philadelphia', 'Riverside', 'Lawrence', 'St. Paul', 'Washington', 'Chicago', 'Pittsburgh', 'Washington', 'Tucson', 'Tempe', 'Potsdam', 'Fort Collins', 'New York', 'Hempstead', 'Lexington', 'Manhattan', 'Baton Rouge', 'Macon', 'Newark', 'Newark', 'Fayetteville', 'Cincinnati', 'University', 'Fairfax', 'Corvallis', 'Pullman', 'Garden City', 'Athens', 'San Diego', 'Rochester', 'Albany', 'Richardson', 'Normal', 'Immaculata', 'Stillwater', 'Merced', 'Chicago', 'La Verne', 'Lowell', 'Seattle', 'Birmingham', 'Baltimore', 'Kingston', 'Tampa', 'La Mirada', 'St Louis', 'Rolla', 'Queens', 'Richmond', 'Jackson', 'Honolulu', 'Madison', 'Melbourne', 'Moscow', 'Louisville', 'Laramie', 'Muncie', 'Nashville', 'Mississippi State', 'Montclair', 'Lubbock', 'Orlando', 'Albuquerque', 'Berrien Springs', 'Azusa', 'Orono', 'Morgantown', 'Chester', 'Kent', 'Fargo', 'New York', 'Moon Township', 'Boston', 'West Hartford', 'Bowling Green', 'Houston', 'Kalamazoo', 'Indianapolis', 'Cambridge', 'Huntsville', 'Denver', 'Reno', 'Fullerton', 'Mount Pleasant', 'Ruston', 'Brookings', 'Fairbanks', 'Charlotte', 'Grand Forks', 'Vermillion', 'Greenville', 'Bozeman', 'Norfolk', 'Kansas City', 'Ashland', 'Dallas', 'DeKalb', 'Ft. Lauderdale', 'Carbondale', 'Missoula', 'Lisle', 'Fresno', 'Boiling Springs', 'Las Cruces', 'Winchester', 'Cookeville', 'Boston', 'North Dartmouth', 'St. Louis', 'Greensboro', 'Hattiesburg', 'Logan']

In [28]:
# Dictionary to map state names to regions
state_to_region = {
    'Princeton': 'Northeast',
    'Cambridge': 'Northeast',
    'Chicago': 'Midwest',
    'New Haven': 'Northeast',
    'New York': 'Northeast',
    'Stanford': 'West',
    'Durham': 'South',
    'Philadelphia': 'Northeast',
    'Baltimore': 'South',
    'Hanover': 'Northeast',
    'Pasadena': 'West',
    'Evanston': 'Midwest',
    'Providence': 'Northeast',
    'Ithaca': 'Northeast',
    'Houston': 'South',
    'Notre Dame': 'Midwest',
    'Nashville': 'South',
    'St. Louis': 'Midwest',
    'Atlanta': 'South',
    'Washington': 'South',
    'Berkeley': 'West',
    'Los Angeles': 'West',
    'Pittsburgh': 'Northeast',
    'Charlottesville': 'South',
    'Medford': 'Northeast',
    'Ann Arbor': 'Midwest',
    'Winston-Salem': 'South',
    'Chapel Hill': 'South',
    'Chestnut Hill': 'Northeast',
    'Williamsburg': 'South',
    'Rochester': 'Northeast',
    'Waltham': 'Northeast',
    'Cleveland': 'Midwest',
    'Santa Barbara': 'West',
    'Boston': 'Northeast',
    'Troy': 'Northeast',
    'New Orleans': 'South',
    'Irvine': 'West',
    'Bethlehem': 'Northeast',
    'Davis': 'West',
    'La Jolla': 'West',
    'Champaign': 'Midwest',
    'Coral Gables': 'South',
    'Madison': 'Midwest',
    'Malibu': 'West',
    'Gainesville': 'South',
    'Villanova': 'Northeast',
    'University Park': 'Northeast',
    'Columbus': 'Midwest',
    'Seattle': 'West',
    'Dallas': 'South',
    'Athens': 'South',
    'Austin': 'South',
    'West Lafayette': 'Midwest',
    'Syracuse': 'Northeast',
    'Storrs': 'Northeast',
    'College Park': 'Northeast',
    'Worcester': 'Northeast',
    'Clemson': 'South',
    'Provo': 'West',
    'Piscataway': 'Northeast',
    'Waco': 'South',
    'Hoboken': 'Northeast',
    'Minneapolis': 'Midwest',
    'College Station': 'South',
    'Amherst': 'Northeast',
    'Blacksburg': 'South',
    'Oxford': 'South',
    'Santa Cruz': 'West',
    'Newark': 'Northeast',
    'Golden': 'West',
    'East Lansing': 'Midwest',
    'Fort Worth': 'South',
    'Iowa City': 'Midwest',
    'Binghamton': 'Northeast',
    'Bloomington': 'Midwest',
    'Milwaukee': 'Midwest',
    'Denver': 'West',
    'San Diego': 'West',
    'Tulsa': 'South',
    'Tallahassee': 'South',
    'Raleigh': 'South',
    'Boulder': 'West',
    'Burlington': 'Northeast',
    'Stony Brook': 'Northeast',
    'Auburn': 'South',
    'Tuscaloosa': 'South',
    'Eugene': 'West',
    'Knoxville': 'South',
    'San Francisco': 'West',
    'Columbia': 'Northeast',
    'Ames': 'Midwest',
    'Dayton': 'Northeast',
    'Lincoln': 'Midwest',
    'Norman': 'South',
    'Stockton': 'West',
    'Salt Lake City': 'West',
    'Houghton': 'Midwest',
    'South Orange': 'Northeast',
    'Riverside': 'West',
    'Lawrence': 'Midwest',
    'St. Paul': 'Midwest',
    'Tucson': 'West',
    'Tempe': 'West',
    'Potsdam': 'Northeast',
    'Fort Collins': 'West',
    'Hempstead': 'Northeast',
    'Lexington': 'South',
    'Manhattan': 'Northeast',
    'Baton Rouge': 'South',
    'Macon': 'South',
    'Fayetteville': 'South',
    'Cincinnati': 'Northeast',
    'University': 'Northeast',
    'Fairfax': 'Northeast',
    'Corvallis': 'West',
    'Pullman': 'West',
    'Garden City': 'Northeast',
    'San Diego': 'West',
    'Rochester': 'Northeast',
    'Albany': 'Northeast',
    'Richardson': 'South',
    'Normal': 'Midwest',
    'Immaculata': 'Northeast',
    'Stillwater': 'South',
    'Merced': 'West',
    'La Verne': 'West',
    'Lowell': 'Northeast',
    'Seattle': 'West',
    'Birmingham': 'South',
    'Kingston': 'Northeast',
    'Tampa': 'South',
    'La Mirada': 'West',
    'St Louis': 'Midwest',
    'Rolla': 'Midwest',
    'Queens': 'Northeast',
    'Richmond': 'South',
    'Jackson': 'South',
    'Honolulu': 'West',
    'Melbourne': 'Northeast',
    'Moscow': 'West',
    'Louisville': 'South',
    'Laramie': 'West',
    'Muncie': 'Midwest',
    'Mississippi State': 'South',
    'Montclair': 'Northeast',
    'Lubbock': 'South',
    'Orlando': 'South',
    'Albuquerque': 'West',
    'Berrien Springs': 'Midwest',
    'Azusa': 'West',
    'Orono': 'Northeast',
    'Morgantown': 'South',
    'Chester': 'Northeast',
    'Kent': 'Northeast',
    'Fargo': 'Midwest',
    'Moon Township': 'Northeast',
    'West Hartford': 'Northeast',
    'Bowling Green': 'Midwest',
    'Kalamazoo': 'Midwest',
    'Indianapolis': 'Northeast',
    'Huntsville': 'South',
    'Denver': 'West',
    'Reno': 'West',
    'Fullerton': 'West',
    'Mount Pleasant': 'Midwest',
    'Ruston': 'South',
    'Brookings': 'Midwest',
    'Buffalo': 'Northeast',
    'Fairbanks': 'West',
    'Charlotte': 'South',
    'Grand Forks': 'Midwest',
    'Vermillion': 'Midwest',
    'Greenville': 'South',
    'Bozeman': 'West',
    'Norfolk': 'Northeast',
    'Kansas City': 'Midwest',
    'Ashland': 'Northeast',
    'Dallas': 'South',
    'DeKalb': 'Midwest',
    'Ft. Lauderdale': 'South',
    'Carbondale': 'Midwest',
    'Missoula': 'West',
    'Lisle': 'Midwest',
    'Fresno': 'West',
    'Boiling Springs': 'Northeast',
    'Las Cruces': 'West',
    'Winchester': 'South',
    'Cookeville': 'South',
    'North Dartmouth': 'Northeast',
    'Greensboro': 'South',
    'Hattiesburg': 'South',
    'Logan': 'West'
}

In [34]:

# List of state names
state_names = ['Princeton', 'Cambridge', 'Chicago', 'New Haven', 'New York', 'Stanford', 'Cambridge', 'Durham', 'Philadelphia', 'Baltimore', 'Hanover', 'Pasadena', 'Evanston', 'Providence', 'Ithaca', 'Houston', 'Notre Dame', 'Nashville', 'St. Louis', 'Atlanta', 'Washington', 'Berkeley', 'Los Angeles', 'Pittsburgh', 'Los Angeles', 'Charlottesville', 'Medford', 'Ann Arbor', 'Winston-Salem', 'Chapel Hill', 'Chestnut Hill', 'Williamsburg', 'Rochester', 'Waltham', 'Atlanta', 'New York', 'Cleveland', 'Santa Barbara', 'Boston', 'Boston', 'Troy', 'New Orleans', 'Irvine', 'Bethlehem', 'Davis', 'La Jolla', 'Champaign', 'Coral Gables', 'Madison', 'Malibu', 'Gainesville', 'Villanova', 'University Park', 'Columbus', 'Seattle', 'Washington', 'Dallas', 'Athens', 'Austin', 'New York', 'West Lafayette', 'Syracuse', 'Storrs', 'College Park', 'Worcester', 'Clemson', 'New York', 'Provo', 'Pittsburgh', 'Piscataway', 'Waco', 'Hoboken', 'Minneapolis', 'Washington', 'Worcester', 'College Station', 'Amherst', 'Blacksburg', 'Oxford', 'Santa Cruz', 'Newark', 'Golden', 'East Lansing', 'Fort Worth', 'Iowa City', 'Binghamton', 'Bloomington', 'Milwaukee', 'Denver', 'San Diego', 'Tulsa', 'Tallahassee', 'Raleigh', 'Boulder', 'Burlington', 'Philadelphia', 'St. Louis', 'Stony Brook', 'Auburn', 'Chicago', 'Syracuse', 'Buffalo', 'Chicago', 'Tuscaloosa', 'Eugene', 'Knoxville', 'Rochester', 'Durham', 'San Francisco', 'Columbia', 'Ames', 'Dayton', 'Columbia', 'Lincoln', 'Norman', 'Stockton', 'Salt Lake City', 'Houghton', 'South Orange', 'Philadelphia', 'Riverside', 'Lawrence', 'St. Paul', 'Washington', 'Chicago', 'Pittsburgh', 'Washington', 'Tucson', 'Tempe', 'Potsdam', 'Fort Collins', 'New York', 'Hempstead', 'Lexington', 'Manhattan', 'Baton Rouge', 'Macon', 'Newark', 'Newark', 'Fayetteville', 'Cincinnati', 'University', 'Fairfax', 'Corvallis', 'Pullman', 'Garden City', 'Athens', 'San Diego', 'Rochester', 'Albany', 'Richardson', 'Normal', 'Immaculata', 'Stillwater', 'Merced', 'Chicago', 'La Verne', 'Lowell', 'Seattle', 'Birmingham', 'Baltimore', 'Kingston', 'Tampa', 'La Mirada', 'St Louis', 'Rolla', 'Queens', 'Richmond', 'Jackson', 'Honolulu', 'Madison', 'Melbourne', 'Moscow', 'Louisville', 'Laramie', 'Muncie', 'Nashville', 'Mississippi State', 'Montclair', 'Lubbock', 'Orlando', 'Albuquerque', 'Berrien Springs', 'Azusa', 'Orono', 'Morgantown', 'Chester', 'Kent', 'Fargo', 'New York', 'Moon Township', 'Boston', 'West Hartford', 'Bowling Green', 'Houston', 'Kalamazoo', 'Indianapolis', 'Cambridge', 'Huntsville', 'Denver', 'Reno', 'Fullerton', 'Mount Pleasant', 'Ruston', 'Brookings', 'Fairbanks', 'Charlotte', 'Grand Forks', 'Vermillion', 'Greenville', 'Bozeman', 'Norfolk', 'Kansas City', 'Ashland', 'Dallas', 'DeKalb', 'Ft. Lauderdale', 'Carbondale', 'Missoula', 'Lisle', 'Fresno', 'Boiling Springs', 'Las Cruces', 'Winchester', 'Cookeville', 'Boston', 'North Dartmouth', 'St. Louis', 'Greensboro', 'Hattiesburg', 'Logan']

# Create a new column 'region'
df_nur['Region']= [state_to_region[state_name] for state_name in state_names]

# Now, 'region_column' contains the corresponding regions for each state name
print( df_nur['Region'])

index
0      Northeast
1      Northeast
2        Midwest
3      Northeast
4      Northeast
         ...
226    Northeast
227      Midwest
228        South
229        South
230         West
Name: Region, Length: 231, dtype: object

In [35]:
df_nur.head()

,Name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment,State Name,State Code,region,Region
index,,,,,,,,,,,
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...","$45,320",NaN,5402,Princeton,NJ,Northeast,Northeast
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...","$47,074",NaN,6699,Cambridge,MA,Northeast,Northeast
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...","$52,491",NaN,5844,Chicago,IL,Midwest,Midwest
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...","$49,480",NaN,5532,New Haven,CT,Northeast,Northeast
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...","$55,056",NaN,6102,New York,NY,Northeast,Northeast